{
  "recipes": [
    {
      "text": "Bacon & roast onion salad",
      "description": "Ingredients:\n1 red onion, cut into 8 wedges, root left intact\n2 tbsp olive oil, plus extra for drizzling (optional)\nhandful of peas (fresh or frozen)\n1 tsp sherry vinegar\n1 tsp Dijon mustard\n2 slices smoked streaky bacon\n1 slice of bread, cut into cubes\n1 Baby Gem lettuce, leaves torn\n\nMethod:\n1. Heat oven to 220C/200C fan/gas 7. Arrange the onion wedges on one side of a baking tray. Drizzle with ½ tbsp of the olive oil and season. Put in the oven and roast for 15 mins.\n2. Meanwhile, cook the peas in boiling water for 2 mins, drain and rinse in very cold water. Set aside.\n3. Make the dressing by mixing together another ½ tbsp of the oil, the vinegar, mustard and seasoning. Turn the onions, and put the bacon slices and bread next to them on the baking tray. Drizzle the remaining oil over the bread. Return the tray to the oven for 12 mins more, until the bacon and bread are golden.\n4. Put the lettuce and peas in a bowl, add the dressing and toss to combine. Arrange the onion and bread on top. Break up the bacon slightly and scatter over. Drizzle with a little more olive oil, if you like, and eat straight away.",
      "level": "low",
      "createDate": "March 9th 2020, 10:05:32 AM",
      "editDate": "",
      "id": 1
    },
    {
      "text": "Braised bacon with colcannon cakes",
      "description": "Ingredients:\n600g lean bacon joint\n700g potato (Maris Piper or King Edwards are good), halved\n400g Savoy cabbage, chopped\n3 tbsp olive oil\n1 small onion, finely chopped\n50g plain flour\n4 large eggs\nketchup, to serve\n\nMethod:\n1. Put the bacon joint in a flameproof casserole dish or heavy-based saucepan and cover with water. Pop on a lid, bring to the boil, then simmer gently for 45 mins until cooked. Meanwhile, boil the potatoes in a pan of salted water for 20 mins. five mins before the end of cooking, add the cabbage. Drain well, return to the pan for 1-2 mins to dry out, then mash together.\n2. Add 1 tbsp of the oil to a frying pan with the onion and cook over a medium heat for 5 mins. add this to the potatoes and cabbage, and mix together with a little seasoning. Set aside. Meanwhile, drain the bacon and leave to rest for 10 mins.\n3. Put the flour on a plate. Shape the potato and cabbage mixture into 8 cakes, then roll them lightly in the flour, tapping off any excess. Add 1 tbsp oil to the frying pan and fry the cakes in 2 batches for 3-4 mins on each side until golden.\n4. Cover the potato cakes with foil and set aside. Wipe the frying pan with kitchen paper, then add the remaining oil. Crack in the eggs and cook until the white is set and the yolk is still runny.\n5. Slice the bacon and serve with the potato cakes, eggs and ketchup.",
      "level": "normal",
      "createDate": "March 9th 2020, 10:08:47 AM",
      "editDate": "",
      "id": 2
    },
    {
      "text": "Boxty with bacon, eggs & tomatoes",
      "description": "Ingredients:\n4 large baking potatoes\n1 bunch spring onions, finely sliced\n100g plain flour\n1 egg white\n150ml buttermilk\n1 tsp bicarbonate of soda\n3 tbsp butter (or more if you need)\n2 tbsp vegetable oil (or more if you need)\nFor the tomatoes:\n6 small bunches cherry tomatoes\nTo serve:\n12 rashers back bacon\n6 eggs, cooked how you like them\n\nMethod:\n1. Before you start, put your oven on its lowest setting, ready to keep things warm. Peel the potatoes, grate 2 of them, then set aside. Cut the other 2 into large chunks, then boil for 10-15 mins or until tender. Meanwhile, squeeze as much of the liquid from the grated potatoes as you can using a clean tea towel. Mash the boiled potatoes, then mix with the grated potato, spring onions and flour.\n2. Whisk the egg white in a large bowl until it holds soft peaks. Fold in the buttermilk, then add the bicarbonate of soda. Fold into the potato mix.\n3. Heat a large non-stick frying pan over a medium heat, then add 1 tbsp butter and some of the oil. Drop 3-4 spoonfuls of the potato mixture into the pan, then gently cook for 3-5 mins on each side until golden and crusty. Keep warm on a plate in the oven while you cook the next batch, adding more butter and oil to the pan before you do so. You will get 16 crumpet-size boxty from the mix. Can be made the day ahead, drained on kitchen paper, then reheated in a low oven for 20 mins.\n4. Heat the grill to medium and put the tomatoes in a heavy-based pan. Add a good knob of butter and a little oil, then fry for about 5 mins until softened. Grill the bacon, then pile onto a plate and keep warm. Stack up the boxty, bacon and egg, and serve the tomatoes on the side.",
      "level": "high",
      "createDate": "March 9th 2020, 10:12:03 AM",
      "editDate": "",
      "id": 3
    },
    {
      "text": "Bacon & parsley hotcakes",
      "description": "Ingredients:\n100g smoked bacon lardons\n100g self-raising flour\n50g grated mature cheddar cheese\n1 tsp fresh thyme leaves, or ½ tsp dried\n2 tbsp chopped parsley\n2 eggs\n6 tbsp milk\nsunflower oil, for frying\npoached eggs and crème fraîche to serve\nMethod:\n1. Dry-fry the lardons until crisp and golden. Tip onto a plate to cool. Mix the flour, cheese, herbs, lardons, salt and pepper in a bowl. Make a well in the centre and drop in the eggs. Beat with a wooden spoon, then gradually add the milk, drawing the flour into the centre as you go. You should end up with a fairly thick batter.\n2. Heat a little oil in a frying pan, drop in large spoonfuls of the batter, then cook until the hotcakes start to set around the edges. Flip them over, then cook until golden. Keep warm while you cook remaining hotcakes.\n3. Serve each person 2 hotcakes topped with a poached egg and a spoonful of crème fraîche, garnishing with extra thyme, if you like.",
      "level": "low",
      "createDate": "March 9th 2020, 10:15:41 AM",
      "editDate": "",
      "id": 4
    },
    {
      "text": "Fluffy American pancakes with cherry-berry syrup",
      "description": "Ingredients:\n350g self-raising flour\n2 tsp baking powder\n¼ tsp ground cinnamon\n2 tsp caster sugar, plus 2 tbsp\n2 large eggs\n150g buttermilk or plain yogurt\n325ml milk\n200g fresh or frozen blueberries\n150g frozen or canned pitted cherries\n1 tsp cornflour\n1 vanilla pod, or 1 tsp bean paste or extract\n200g thick-cut smoked streaky bacon\nflavourless oil, such as vegetable or sunflower, for frying\n200g mascarpone\nmaple syrup, to serve\nMethod:\n1. Make the pancake batter up to a day ahead, or just before cooking. Tip the flour, baking powder, cinnamon and 2 tsp sugar into a bowl, add a good pinch of salt and combine with a whisk. Add the eggs, buttermilk or yogurt and milk to the bowl and whisk into a smooth batter. If making ahead, cover and chill until ready to cook.\n2. Tip the blueberries, cherries, cornflour, 2 tbsp sugar and the vanilla into a pan, and stir until the berries are coated in cornflour. Add 1 tbsp water, then place over a high heat and bubble for a minute or 2 until syrupy but the berries are still holding their shape. Set aside to cool, then remove the vanilla pod, if using. This is best served warm.\n3. Heat the grill to medium-high and arrange the bacon on a baking tray lined with foil. Set aside. If you have a separate oven, heat this to a low setting (50C/30C fan/gas ½) with a baking tray in it (this is to keep the pancakes warm as you cook them). If not, they can sit under the bacon, just keep a close eye on them.\n4. Heat a glug of oil in a large, heavy frying pan, wipe the oil around the pan with a piece of kitchen paper, leaving a fine coating of oil on the surface. Transfer the pancake batter to a jug. When the pan is hot but not smoking (keep it over a moderate heat) pour the batter into the pan, making 7-8cm pancakes, with plenty of space between them (you should fit three pancakes in at a time). The batter should sizzle a little as it hits the pan, but not aggressively – adjust the heat if you need to. Cook each pancake until the underside is golden; by this time bubbles should be appearing on the surface and the edges beginning to set, indicating that the pancake is ready to flip over. Use a fish slice to do this. They should take roughly 2 mins on each side. Transfer the pancakes to the warm baking tray. Wipe a little more oil around the pan and continue cooking the rest of the batter in this way. You should make 12 pancakes.\n5. When you’re halfway through the batter, grill the bacon for 4-5 mins on each side until crispy.\n6. To serve, stack the pancakes with a dollop of mascarpone, bacon, and fruits between each layer, and serve with a jug of maple syrup.",
      "level": "normal",
      "createDate": "March 9th 2020, 10:20:25 AM",
      "editDate": "",
      "id": 5
    },
    {
      "text": "Waffles",
      "description": "Ingredients:\n4 large eggs, separated\n300g plain flour\n½ tsp bicarbonate of soda\n2 tbsp golden caster sugar\n50g butter, melted\n600ml semi-skimmed milk\nMethod:\n1. Heat the waffle maker according to manufacturer's instructions. Whisk the egg whites to stiff peaks. In a separate large bowl, mix together the flour, bicarbonate, caster sugar and a pinch of salt. \n2. Make a well in the centre and add the egg yolks and melted butter. Start mixing with a balloon whisk; keep whisking as you slowly add the milk until you get a smooth, thick batter. Carefully fold in the egg whites with a metal spoon.\n3. Heat oven to 180C/160C fan/gas 4. Use a ladle to pour the batter into your waffle maker and cook for 5 mins or according to the manufacturer's instructions. Repeat until all the batter has been used up, placing your finished waffles onto a baking tray as you go.\n4. Once all the waffles are made, transfer to the oven for 5 mins to warm through and crisp. Serve with sweet or savoury toppings.",
      "level": "low",
      "createDate": "March 9th 2020, 10:22:56 AM",
      "editDate": "",
      "id": 6
    },
    {
      "text": " Fish pie with saffron mash",
      "description": "Ingredients:\n3 shallots, finely chopped\n3 tbsp white wine vinegar\n150ml white wine\n142ml pot double cream\n900g fresh haddock fillets, skinned\n200g bag raw, peeled prawn, preferably unfrozen\n800g fresh spinach (about 2 bags)\n200g crabmeat\nFor the topping:\n3 garlic cloves\n1 red chilli, halved and deseeded\n200ml full-fat milk\npinch saffron strands\n1¼kg potato, cut into large chunks\n4 tbsp olive oil\nzest and juice 1 lemon\nMethod:\n1. Tip the shallots and vinegar into a saucepan and place on the heat so the vinegar evaporates quickly. Splash in the white wine and reduce until practically dry. Add cream, bring to the boil, then simmer gently until reduced by two-thirds and very thick. Leave to cool. Cut the fish into bite-size chunks and set aside with the prawns.\n2. Tip spinach into a large colander and pour over boiling water from a kettle until all the spinach is wilted (you may need to do this more than once). Cool under the cold tap, then squeeze the spinach tightly to get rid of any excess liquid.\n3. To make the topping, mash the saffron, garlic and chilli together using a pestle and mortar. Tip into a saucepan with the milk, bring to the boil, then remove from the heat to infuse. Bring the potatoes to the boil and simmer for 15 mins until soft. Drain, then mash well with the infused milk, olive oil, lemon juice and zest.\n4. Heat oven to 200C/fan 180C/gas 6. To assemble the pie, mix the fish and prawns into the cold cream until completely coated. Tip the fish into the bottom of a large gratin dish and scatter over clumps of crabmeat. Unravel the spinach and lay it over the fish, then top with the mash. Cook the pie for about 30 mins until golden and starting to brown and bubble around the edges. Serve with green veg if you like.",
      "level": "high",
      "createDate": "March 9th 2020, 10:27:45 AM",
      "editDate": "",
      "id": 7
    },
    {
      "text": "Chocolate sponge cake",
      "description": "Ingredients:\n175g unsalted butter, softened, plus extra for the tin\n175g golden caster sugar\n3 large eggs\n50g cocoa powder\n100g self-raising flour (or same quantity plain flour with 1 tsp baking powder)\n1-2 tsp milk\nFor the buttercream:\n50g dark chocolate (or milk chocolate if you prefer)\n85g unsalted butter, softened\n175g icing sugar, sieved\nMethod\n1. Heat oven to 190C/170C fan/gas 5. Butter and line two 20cm sandwich tins with baking parchment.\n2. Use a handheld electric whisk or a freestanding mixer to beat 175g softened unsalted butter and 175g golden caster sugar together in a bowl until creamy and light in colour. Then add 1 large egg, still mixing.\n3. Sieve 50g cocoa powder, 100g self-raising flour and a pinch of salt into another bowl and add a third of that to your wet ingredients.\n4. Once combined, add 1 more large egg and another third of the flour mixture and work that in.\n5. Then add 1 more large egg and the remaining flour and beat until you have a smooth thick batter. If the batter is stiff, stir in a splash of milk to loosen it.\n6. Divide the mixture between the tins and smooth the top with the back of a spoon.\n7. Bake for 20-25 mins until springy to the touch. Take out of the oven and leave in the tins for 10 mins before turning out onto a wire rack to cool completely.\n8. Meanwhile, make the buttercream by melting 50g dark or milk chocolate in the microwave, or in a bowl over just simmering water, making sure the base doesn’t touch the water. Leave to cool. \n9. Beat 85g softened unsalted butter and half of the 175g sieved icing sugar together until light and fluffy. Add the remaining icing sugar and melted chocolate and mix together. If the icing is runny, chill in the fridge until it is firm but still spreadable.\n10. To assemble the cake, put a small dollop of icing onto a plate and put one of the cakes on top. Spread the top of the cake with half the icing, leaving a 1cm border around the edge.\n11. Put the second cake on top and push down very gently. Spread the remaining icing over the top.",
      "level": "high",
      "createDate": "March 9th 2020, 10:30:21 AM",
      "editDate": "",
      "id": 8
    }
  ]
}